import React from 'react'
import {  Recommend } from '../../container'
import clas from './main.module.scss'
import Carousel from 'react-gallery-carousel'
import 'react-gallery-carousel/dist/index.css';
import './index.css'
import { Rating } from 'react-simple-star-rating'
import { ShopBasket } from '../../assets/icons';
import Click from '../../assets/icons/logo.png'
import Apelsin from '../../assets/icons/apelsin-logo-light.b49ddc7.svg'
import Payme from '../../assets/icons/download.svg'
import { Buttons } from '../../components';
import { useState } from 'react';

const SingleBook = () => {
    const [tab, setTab] = useState(false)
    const images = [9, 8, 7, 6, 5].map((number) => ({
        src: `https://placedog.net/${number}00/${number}00?id=${number}`
    }));
    return <React.Fragment>
        <div className={clas.SingleBook_wrapper}>
            <div className={clas.page_holder}>
                <div className="container">
                    <div className={clas.has_stock}>
                        <span>Код товара: 235623</span>
                        <button>
                        <svg width="166" height="25" viewBox="0 0 166 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect width="166" height="25" rx="12.5" fill="#C1FBD1" fill-opacity="0.5"/>
                            <g clip-path="url(#clip0_340_5513)">
                            <path d="M43.4954 5.4165C42.0945 5.4165 40.725 5.83193 39.5602 6.61026C38.3953 7.38859 37.4874 8.49485 36.9513 9.78916C36.4152 11.0835 36.2749 12.5077 36.5482 13.8817C36.8215 15.2558 37.4962 16.5179 38.4868 17.5085C39.4774 18.4991 40.7395 19.1738 42.1136 19.4471C43.4876 19.7204 44.9118 19.5801 46.2061 19.044C47.5004 18.5079 48.6067 17.6 49.385 16.4351C50.1633 15.2703 50.5788 13.9008 50.5788 12.4998C50.5788 11.5696 50.3956 10.6486 50.0396 9.78916C49.6836 8.92977 49.1619 8.14891 48.5041 7.49116C47.8464 6.83342 47.0655 6.31166 46.2061 5.95569C45.3467 5.59972 44.4256 5.4165 43.4954 5.4165ZM46.5413 10.8069L43.3042 15.0569C43.2382 15.1426 43.1535 15.2121 43.0565 15.26C42.9595 15.3079 42.8528 15.3329 42.7446 15.3332C42.637 15.3337 42.5307 15.3098 42.4338 15.2632C42.3368 15.2165 42.2517 15.1484 42.185 15.064L40.4567 12.8611C40.3412 12.7127 40.2893 12.5244 40.3126 12.3378C40.3358 12.1512 40.4322 11.9814 40.5807 11.8659C40.7291 11.7503 40.9173 11.6985 41.1039 11.7217C41.2906 11.745 41.4603 11.8414 41.5759 11.9898L42.7304 13.4632L45.4079 9.9215C45.4647 9.84709 45.5355 9.78458 45.6164 9.73754C45.6973 9.6905 45.7867 9.65986 45.8794 9.64736C45.9722 9.63487 46.0665 9.64076 46.157 9.6647C46.2474 9.68865 46.3323 9.73018 46.4067 9.78692C46.4811 9.84366 46.5436 9.91451 46.5907 9.99541C46.6377 10.0763 46.6683 10.1657 46.6808 10.2584C46.6933 10.3512 46.6874 10.4455 46.6635 10.5359C46.6395 10.6264 46.598 10.7113 46.5413 10.7857V10.8069Z" fill="#3DB04F"/>
                            </g>
                            <path d="M59.417 17V7.9H63.33C64.318 7.9 65.0937 8.09933 65.657 8.498C66.2203 8.89667 66.502 9.47733 66.502 10.24C66.502 10.9853 66.2333 11.5573 65.696 11.956C65.1587 12.346 64.4523 12.541 63.577 12.541L63.811 12.151C64.825 12.151 65.6007 12.3547 66.138 12.762C66.684 13.1607 66.957 13.7457 66.957 14.517C66.957 15.297 66.671 15.908 66.099 16.35C65.5357 16.7833 64.695 17 63.577 17H59.417ZM60.704 15.973H63.551C64.2443 15.973 64.7643 15.8473 65.111 15.596C65.4663 15.336 65.644 14.9417 65.644 14.413C65.644 13.8843 65.4663 13.4987 65.111 13.256C64.7643 13.0133 64.2443 12.892 63.551 12.892H60.704V15.973ZM60.704 11.904H63.239C63.8717 11.904 64.3527 11.7783 64.682 11.527C65.02 11.2757 65.189 10.9073 65.189 10.422C65.189 9.928 65.02 9.55533 64.682 9.304C64.3527 9.05267 63.8717 8.927 63.239 8.927H60.704V11.904ZM72.4121 17V10.11H73.6601V13.035H77.5861V10.11H78.8341V17H77.5861V14.114H73.6601V17H72.4121ZM85.4858 17V15.544L85.4208 15.271V12.788C85.4208 12.2593 85.2648 11.852 84.9528 11.566C84.6494 11.2713 84.1901 11.124 83.5748 11.124C83.1674 11.124 82.7688 11.1933 82.3788 11.332C81.9888 11.462 81.6594 11.6397 81.3908 11.865L80.8708 10.929C81.2261 10.643 81.6508 10.4263 82.1448 10.279C82.6474 10.123 83.1718 10.045 83.7178 10.045C84.6624 10.045 85.3904 10.2747 85.9018 10.734C86.4131 11.1933 86.6688 11.8953 86.6688 12.84V17H85.4858ZM83.2238 17.078C82.7124 17.078 82.2618 16.9913 81.8718 16.818C81.4904 16.6447 81.1958 16.4063 80.9878 16.103C80.7798 15.791 80.6758 15.44 80.6758 15.05C80.6758 14.6773 80.7624 14.3393 80.9358 14.036C81.1178 13.7327 81.4081 13.49 81.8068 13.308C82.2141 13.126 82.7601 13.035 83.4448 13.035H85.6288V13.932H83.4968C82.8728 13.932 82.4524 14.036 82.2358 14.244C82.0191 14.452 81.9108 14.7033 81.9108 14.998C81.9108 15.336 82.0451 15.609 82.3138 15.817C82.5824 16.0163 82.9551 16.116 83.4318 16.116C83.8998 16.116 84.3071 16.012 84.6538 15.804C85.0091 15.596 85.2648 15.2927 85.4208 14.894L85.6678 15.752C85.5031 16.1593 85.2128 16.4843 84.7968 16.727C84.3808 16.961 83.8564 17.078 83.2238 17.078ZM87.772 16.987L87.85 15.934C87.9107 15.9427 87.967 15.9513 88.019 15.96C88.071 15.9687 88.1187 15.973 88.162 15.973C88.4394 15.973 88.656 15.8777 88.812 15.687C88.9767 15.4963 89.098 15.245 89.176 14.933C89.254 14.6123 89.3104 14.2527 89.345 13.854C89.3797 13.4553 89.4057 13.0567 89.423 12.658L89.54 10.11H94.831V17H93.583V10.838L93.882 11.202H90.346L90.632 10.825L90.541 12.736C90.515 13.3427 90.4674 13.9103 90.398 14.439C90.3287 14.9677 90.2204 15.4313 90.073 15.83C89.9344 16.2287 89.7394 16.5407 89.488 16.766C89.2454 16.9913 88.929 17.104 88.539 17.104C88.4264 17.104 88.305 17.091 88.175 17.065C88.0537 17.0477 87.9194 17.0217 87.772 16.987ZM97.2442 17V10.11H98.4922V15.128L102.717 10.11H103.848V17H102.6V11.982L98.3882 17H97.2442ZM110.613 14.179C110.249 14.3523 109.872 14.491 109.482 14.595C109.1 14.6903 108.706 14.738 108.299 14.738C107.467 14.738 106.808 14.543 106.323 14.153C105.846 13.763 105.608 13.1607 105.608 12.346V10.11H106.856V12.268C106.856 12.762 107.007 13.126 107.311 13.36C107.623 13.594 108.039 13.711 108.559 13.711C108.888 13.711 109.226 13.6677 109.573 13.581C109.928 13.4943 110.275 13.373 110.613 13.217V14.179ZM110.522 17V10.11H111.77V17H110.522ZM114.192 17V10.11H115.44V15.128L119.665 10.11H120.796V17H119.548V11.982L115.336 17H114.192ZM123.219 17V10.11H124.467V15.128L128.692 10.11H129.823V17H128.575V11.982L124.363 17H123.219Z" fill="#3DB04F"/>
                            <defs>
                            <clipPath id="clip0_340_5513">
                            <rect width="17" height="17" fill="white" transform="translate(35 4)"/>
                            </clipPath>
                            </defs>
                            </svg>
                        </button>
                    </div>                    
                    <h2>Книга Госпожа Бовари. Гюстав Флобер</h2>
                </div>
            </div>

            <div className={clas.book_info}>
                <div className="container">
                    <div className={clas.inner}>
                        <div className={clas.book_image}>
                            <Carousel isLoop={true} hasMediaButton={false} autoPlayInterval={2000} isAutoPlaying hasSizeButton={false} images={images} style={{ height: 520, width: 520 }} />
                        </div>
                        <div className={clas.book_short}>
                            <h5>Коротко о товаре</h5>
                            <div className={clas.book_price}>
                                <ul>
                                    <li>Автор:</li>
                                    <li>Гюстав Флобер</li>
                                </ul>
                                <ul>
                                    <li>Категория:</li>
                                    <li>Художественная <br /> литература</li>
                                </ul>
                                <ul>
                                    <li>Наличие:</li>
                                    <li>Есть в наличие</li>
                                </ul>

                                <ul>
                                    <li>Издательство:</li>
                                    <li>Речь, 2018</li>
                                </ul>
                                <ul>
                                    <li>Страницы:</li>
                                    <li>335</li>
                                </ul>

                                <ul>
                                    <li>Код товара:</li>
                                    <li>235623</li>
                                </ul>
                                <div className={clas.rating}>
                                    <Rating initialValue={4} size={20} />
                                    <span>(165)</span>
                                </div>
                                <span className={clas.price}>Цена 52 000 сум</span>
                            </div>
                        </div>
                        <div className={clas.book_payment}>
                            <div className={clas.payment}>
                                <div className={clas.counter}>
                                    <button>-</button>
                                    <span>1</span>
                                    <button>+</button>
                                </div>
                                <div className={clas.add_basket}>
                                    <button>
                                        <ShopBasket />
                                        <span>В корзину</span>
                                    </button>
                                </div>
                                <button className={clas.order}>Сделать предзаказ</button>
                                <div className={clas.payment_ways}>
                                    <h3>Способ оплаты:</h3>
                                    <ul>
                                        <li><img src={Apelsin} alt="" /></li>
                                        <li><img src={Click} alt="" /></li>
                                        <li><img src={Payme} alt="" /></li>
                                    </ul>
                                </div>
                            </div>
                        </div>

                    </div>
                </div>
            </div>

            <div className={clas.tab}>
                        <div className="container">
                        <button className={tab ? '' : clas.active} onClick={() => setTab(false)}> Описание</button>
                        <button className={tab ? clas.active : ''} onClick={() => setTab(true)}>Отзывы</button>
                        </div>
                </div>

            <div className={`${clas.description} ${tab ? clas.active : null}`}>
                <div className="container">
                    <h1>Описание</h1>
                    <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris ullamcorper malesuada egestas vitae placerat. Etiam blandit nascetur tortor in tortor. Egestas sed diam consequat accumsan vitae. Leo aenean est arcu imperdiet commodo. Sollicitudin pretium, amet, diam mauris, dolor. Lectus ac mi tellus aliquam diam, elementum, tellus mi sollicitudin. Dictum a leo sollicitudin vel adipiscing etiam purus hendrerit. Pellentesque dui habitant tortor quis at blandit non eu. Id blandit ac scelerisque volutpat fermentum. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris ullamcorper malesuada egestas vitae placerat. Etiam blandit nascetur tortor in tortor. Egestas sed diam consequat accumsan vitae. Leo aenean est arcu imperdiet commodo. Sollicitudin pretium, amet, diam mauris, dolor. Pellentesque dui habitant tortor quis at blandit non eu. Id blandit ac scelerisque volutpat fermentum.</p>
                </div>
            </div>
            <div 
            className={`${clas.leave_comment} ${tab ? null : clas.active}`}
            >
                <div className="container">
                    <h1>Отзывы</h1>

                    <div className={clas.comments_wrapper}>
                        <button className={clas.add_comment}>
                            <svg width="18" height="24" viewBox="0 0 18 24" fill="#F7A302" xmlns="http://www.w3.org/2000/svg">
                            <path d="M1.44535 0H16.5546C17.3525 0 18 0.640345 18 1.42331V22.5767C18 23.3624 17.3497 24 16.5546 24H1.44535C0.647522 24 1.90735e-06 23.3596 1.90735e-06 22.5767V1.42331C-2.86102e-05 0.640345 0.647522 0 1.44535 0ZM1.09014 22.5794C1.09014 22.7839 1.23767 22.9292 1.44532 22.9292H16.5546C16.7623 22.9292 16.9098 22.7839 16.9098 22.5794V1.42331C16.9098 1.21883 16.7623 1.07354 16.5546 1.07354H1.44535C1.23771 1.07354 1.09017 1.21883 1.09017 1.42331V22.5794H1.09014ZM3.59836 16.8538C3.59836 17.1444 3.83333 17.3758 4.12841 17.3758H10.918C11.2131 17.3758 11.4481 17.1444 11.4481 16.8538C11.4481 16.5632 11.2131 16.3318 10.918 16.3318H4.13115C3.86337 16.3023 3.59836 16.5632 3.59836 16.8538ZM3.59836 20.0798C3.59836 20.3704 3.83333 20.6018 4.12841 20.6018H10.918C11.2131 20.6018 11.4481 20.3704 11.4481 20.0798C11.4481 19.7893 11.2131 19.5579 10.918 19.5579H4.13115C3.86337 19.5283 3.59836 19.7893 3.59836 20.0798ZM3.59836 13.6574C3.59836 13.948 3.83333 14.1794 4.12841 14.1794H10.918C11.2131 14.1794 11.4481 13.948 11.4481 13.6574C11.4481 13.3668 11.2131 13.1354 10.918 13.1354H4.13115C3.86337 13.1354 3.59836 13.3668 3.59836 13.6574ZM3.59836 10.4906C3.59836 10.7812 3.83333 11.0125 4.12841 11.0125H10.918C11.2131 11.0125 11.4481 10.7812 11.4481 10.4906C11.4481 10.2 11.2131 9.96861 10.918 9.96861H4.13115C3.86337 9.96861 3.59836 10.2 3.59836 10.4906ZM11.4781 7.32376C11.4781 7.03318 11.2432 6.8018 10.9481 6.8018H4.22129C3.92621 6.8018 3.69124 7.03318 3.69124 7.32376C3.69124 7.61434 3.92621 7.84573 4.22129 7.84573H10.9453C11.2404 7.84573 11.4781 7.61434 11.4781 7.32376ZM11.4781 4.12734C11.4781 3.83676 11.2432 3.60537 10.9481 3.60537H4.22129C3.92621 3.60537 3.69124 3.83676 3.69124 4.12734C3.69124 4.41792 3.92621 4.64931 4.22129 4.64931H10.9453C11.2404 4.67892 11.4781 4.41795 11.4781 4.12734ZM13.4262 4.12734C13.4262 4.44753 13.6913 4.7085 14.0164 4.7085C14.3415 4.7085 14.6065 4.4475 14.6065 4.12734C14.6065 3.80716 14.3415 3.54619 14.0164 3.54619C13.6912 3.54619 13.4262 3.80719 13.4262 4.12734ZM13.4262 7.32376C13.4262 7.64395 13.6913 7.90492 14.0164 7.90492C14.3415 7.90492 14.6065 7.64392 14.6065 7.32376C14.6065 7.00361 14.3415 6.74261 14.0164 6.74261C13.6912 6.713 13.4262 6.974 13.4262 7.32376ZM13.4262 10.4314C13.4262 10.7516 13.6913 11.0125 14.0164 11.0125C14.3415 11.0125 14.6065 10.7515 14.6065 10.4314C14.6065 10.1112 14.3415 9.85023 14.0164 9.85023C13.6912 9.82332 13.4262 10.0843 13.4262 10.4314ZM13.4262 13.6009C13.4262 13.9211 13.6913 14.182 14.0164 14.182C14.3415 14.182 14.6065 13.921 14.6065 13.6009C14.6065 13.2807 14.3415 13.0197 14.0164 13.0197C13.6912 13.0197 13.4262 13.2807 13.4262 13.6009ZM13.4262 16.8834C13.4262 17.2036 13.6913 17.4646 14.0164 17.4646C14.3415 17.4646 14.6065 17.2036 14.6065 16.8834C14.6065 16.5632 14.3415 16.3023 14.0164 16.3023C13.6912 16.3023 13.4262 16.5632 13.4262 16.8834ZM13.4262 20.0798C13.4262 20.4 13.6913 20.661 14.0164 20.661C14.3415 20.661 14.6065 20.4 14.6065 20.0798C14.6065 19.7596 14.3415 19.4987 14.0164 19.4987C13.6912 19.4691 13.4262 19.7596 13.4262 20.0798Z" fill="#F7A302"/>
                            </svg>
                            <span>Оставить отзыв</span>
                        </button>
                        <div className={clas.comment}>
                            <div className={clas.comment_card}>
                                <h3>Kathryn Murphy</h3>
                                <Rating initialValue={5} size={20}/>
                                <span className={clas.date}>19 февраля 2022</span>
                                <p>А ещё тщательные исследования конкурентов, вне зависимости от их уровня, должны быть смешаны с не уникальными данными до степени совершенной неузнаваемости</p>
                                <div className={clas.reply_like}>
                                    <button className={clas.reply}>Oтветить</button>
                                    <div className={clas.like}>
                                        <Buttons/>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div className="container" style={{marginTop: '40px'}}>
        <Recommend />
        </div>
    </React.Fragment>
}

export default SingleBook