export const categories = [
    {
        name: 'Художественная литература',
        id: '1',
    },
    {
        name: 'Психология и мотивация',
        id: '2'
    },
    {
        name: 'Досуг и хобби',
        id: '3'
    },
    {
        name: 'Бизнес',
        id: '4'
    },
    {
        name: 'Детская литература',
        id: '5'
    },
    {
        name: 'Для родителей',
        id: '6'
    },
    {
        name: 'Для школы',
        id: '7'
    },
    {
        name: 'Для подростков',
        id: '8'
    },
    {
        name: 'Научно-популярные издания',
        id: '9'
    },
    {
        name: 'Скоро в продаже',
        id: '10'
    },
]